var init = {
  // 主砲/副砲：12cm単装砲,12.7cm連装砲,12.7cm単装砲,120mm/50 連装砲,10cm連装高角砲,14cm単装砲,15.5cm三連装砲,20.3cm連装砲,15.2cm連装砲,20.3cm(2号)連装砲,35.6cm連装砲,41cm連装砲,46cm三連装砲,12.7cm連装高角砲,15.2cm単装砲,15.5cm三連装副砲,8cm高角砲,12cm単装高角砲,10cm連装高角砲(砲架),試製46cm連装砲,38cm四連装砲,16inch Mk.I三連装砲,20連装7inch UP Rocket Launchers,二式12cm迫撃砲改,12cm単装高角砲E型
  "主砲/副砲": [1, 2, 78, 147, 3, 4, 5, 6, 65, 90, 7, 8, 9, 10, 11, 12, 66, 48, 71, 117, 245, 298, 301, 346, 382],
  // 魚雷：61cm三連装魚雷,61cm四連装魚雷,61cm四連装(酸素)魚雷,甲標的 甲型,後期型艦首魚雷(6門),21inch艦首魚雷6門(初期型),潜水艦後部魚雷4門(初期型),後期型艦首魚雷(4門),21inch艦首魚雷4門(初期型),潜水艦搭載電探＆水防式望遠鏡
  "魚雷": [13, 14, 15, 41, 213, 440, 442, 457, 511, 210],
  // 艦上攻撃機：九七式艦攻,天山,流星,流星改,SBD,F4F-3,Swordfish
  "艦上攻撃機": [16, 17, 18, 52, 195, 197, 242],
  // 艦上戦闘機：九六式艦戦,零式艦戦21型,零式艦戦52型,試製烈風 後期型,紫電改二,零式艦戦32型,Fulmar,紫電一一型
  "艦上戦闘機": [19, 20, 21, 22, 55, 181, 249, 201],
  // 艦上爆撃機：九九式艦爆,彗星,彗星一二型甲,零式艦戦62型(爆戦)
  "艦上爆撃機": [23, 24, 57, 60],
  // 水偵水爆：零式水上偵察機,瑞雲,零式水上観測機,九八式水上偵察機(夜偵),Ro.43水偵,Laté 298B,瑞雲(六三一空)
  "水偵水爆": [25, 26, 59, 102, 163, 194, 207],
  // 電探：13号対空電探,22号対水上電探,33号対水上電探,21号対空電探,32号対水上電探,42号対空電探
  "電探": [27, 28, 29, 30, 31, 32],
  // 増設：改良型艦本式タービン,強化型艦本式缶,増設バルジ(中型艦),増設バルジ(大型艦)
  "増設": [33, 34, 72, 73],
  // 砲弾：7.7mm機銃,12.7mm単装機銃,25mm連装機銃,25mm三連装機銃,25mm単装機銃,12cm30連装噴進砲,三式弾,九一式徹甲弾
  "砲弾": [37, 38, 39, 40, 49, 51, 35, 36],
  // ソナー/爆雷：九四式爆雷投射機,三式爆雷投射機,九五式爆雷,九三式水中聴音機,三式水中探信儀
  "ソナー/爆雷": [44, 45, 226, 46, 47],
  // 艦上偵察機：彩雲,二式艦上偵察機
  "艦上偵察機": [54, 61],
  // 其の他：大発動艇,カ号観測機,三式指揮連絡機(対潜),探照灯,ドラム缶(輸送用),91式高射装置,九六式陸攻,三式戦 飛燕,一式戦 隼II型,Spitfire Mk.I,二式複戦 屠龍,発煙装置(煙幕)
  "其の他": [68, 69, 70, 74, 75, 120, 168, 176, 221, 250, 445, 500, -1]
};